# coding=utf-8
import numpy as np
import pandas as pd

dates = pd.date_range('20180719', periods=6)
print dates
print '------------------------------------------------'

df = pd.DataFrame(np.arange(24).reshape(6, 4), index=dates, columns=['a', 'b', 'c', 'd'])

print df['a']
print df.a
# 只输出a列 的两种方式

print '0-3行数据------------------------------------------------'
print df[0:3]
print '20180721-20180724之间的行数据------------------------------------------------'
print df['20180721':'20180724']

print '按标签选择数据------------------------------------------------'
print df.loc['20180724']
print '选择所有行ab两列数据------------------------------------------------'
print df.loc[:, ['a', 'b']]

print '2行1列的数据------------------------------------------------'
print df.iloc[2, 1]
print '2行到5行 1到3列的数据------------------------------------------------'
print df.iloc[2:5, 1:3]

print '混合筛选------------------------------------------------'
print '0到3行 ac两列------------------------------------------------'
print df.ix[:3, ['a', 'c']]

print '是否筛选------------------------------------------------'
print df[df.a < 8]
